app/views/shop/index.html.erb

SELECT "shop_images".* FROM "shop_images" WHERE "shop_images"."shop_id" = $1  [["shop_id", 7]]
SELECT "shops".* FROM "shops" WHERE (is_deleted = 'f')
SELECT COUNT(*) FROM "shop_images" WHERE "shop_images"."shop_id" = $1  [["shop_id", 7]]
SELECT COUNT(*) FROM "shops" WHERE (is_deleted = 'f')
---

												<% if shop.shop_images.size > 0 %>